---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimStyleAngularUnitsAlt
source: html/6870b256-51cb-4b07-9728-16f852f67126.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimStyleAngularUnitsAlt Property

"Alternate Units Format"

## Syntax (C#)
```csharp
public static ForgeTypeId DimStyleAngularUnitsAlt { get; }
```